; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v4 - type_1 ?v5 - type_2)
 	      (pred_2 ?v8 - object ?v5 - type_2)
	      (pred_3 ?v4 - type_1 ?v1 - type_3)
	      (pred_1 ?v4 - type_1 ?v8 - object ?v1 - type_3))

   (:action op_3
       :parameters  (?v4 - type_1 ?v2 ?v6 - type_2)
       :precondition (and  (pred_4 ?v4 ?v2))
       :effect (and  (pred_4 ?v4 ?v6)
		     (not (pred_4 ?v4 ?v2))))

   (:action op_1
       :parameters (?v4 - type_1 ?v7 - object ?v3 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_2 ?v7 ?v3) (pred_4 ?v4 ?v3) (pred_3 ?v4 ?v1))
       :effect (and (pred_1 ?v4 ?v7 ?v1)
		    (not (pred_2 ?v7 ?v3)) 
		    (not (pred_3 ?v4 ?v1))))

   (:action op_2
       :parameters (?v4 - type_1 ?v7 - object ?v3 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_1 ?v4 ?v7 ?v1) (pred_4 ?v4 ?v3))
       :effect (and (pred_2 ?v7 ?v3)
		    (pred_3 ?v4 ?v1)
		    (not (pred_1 ?v4 ?v7 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_12 obj_10 - type_1
obj_05 obj_03 obj_01 obj_13 - type_3
obj_02 obj_14 obj_04 obj_11 - type_2
obj_09 obj_06 obj_07 obj_08 - object)
(:init
(pred_4 obj_12 obj_14)
(pred_3 obj_12 obj_05)
(pred_3 obj_12 obj_03)
(pred_4 obj_10 obj_02)
(pred_3 obj_10 obj_01)
(pred_3 obj_10 obj_13)
(pred_2 obj_09 obj_14)
(pred_2 obj_06 obj_04)
(pred_2 obj_07 obj_14)
(pred_2 obj_08 obj_14)
)
(:goal
(and
(pred_2 obj_09 obj_04)
(pred_2 obj_06 obj_04)
(pred_2 obj_07 obj_02)
(pred_2 obj_08 obj_14)
)
)

(:constraints
  (always (not (pred_4 obj_12 obj_04)))
)
)

; plan
1. (op_1 obj_12 obj_09 obj_14 obj_03)
   deleted: (pred_2 obj_09 obj_14) (pred_3 obj_12 obj_03)
   added: (pred_1 obj_12 obj_09 obj_03)
   goals met: 2 of 4
2. (op_1 obj_12 obj_07 obj_14 obj_05)
   deleted: (pred_2 obj_07 obj_14) (pred_3 obj_12 obj_05)
   added: (pred_1 obj_12 obj_07 obj_05)
   goals met: 2 of 4
3. (op_3 obj_12 obj_14 obj_02)
   deleted: (pred_4 obj_12 obj_14)
   added: (pred_4 obj_12 obj_02)
   goals met: 2 of 4
4. (op_2 obj_12 obj_07 obj_02 obj_05)
   deleted: (pred_1 obj_12 obj_07 obj_05)
   added: (pred_2 obj_07 obj_02) (pred_3 obj_12 obj_05)
   goals met: 3 of 4
5. (op_2 obj_12 obj_09 obj_02 obj_03)
   deleted: (pred_1 obj_12 obj_09 obj_03)
   added: (pred_2 obj_09 obj_02) (pred_3 obj_12 obj_03)
   goals met: 3 of 4
6. (op_1 obj_10 obj_09 obj_02 obj_13)
   deleted: (pred_2 obj_09 obj_02) (pred_3 obj_10 obj_13)
   added: (pred_1 obj_10 obj_09 obj_13)
   goals met: 3 of 4
7. (op_3 obj_10 obj_02 obj_04)
   deleted: (pred_4 obj_10 obj_02)
   added: (pred_4 obj_10 obj_04)
   goals met: 3 of 4
8. (op_2 obj_10 obj_09 obj_04 obj_13)
   deleted: (pred_1 obj_10 obj_09 obj_13)
   added: (pred_2 obj_09 obj_04) (pred_3 obj_10 obj_13)
   goals met: 4 of 4
